; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj4 - airport
	obj1 obj5 - city
	obj2 obj3 - location
	obj6 obj8 obj9 obj13 - truck
	obj7 obj16 - airplane
	obj10 obj11 obj12 obj14 obj15 - package
)

(:init
	(in-city obj4 obj5)
	(at obj12 obj2)
	(at obj16 obj4)
	(in-city obj0 obj1)
	(at obj8 obj0)
	(at obj7 obj4)
	(at obj15 obj4)
	(at obj13 obj3)
	(at obj10 obj2)
	(at obj9 obj4)
	(in-city obj3 obj1)
	(at obj11 obj3)
	(at obj14 obj0)
	(in-city obj2 obj1)
	(at obj6 obj2)
)

(:goal (and
	(at obj11 obj0)
	(at obj10 obj3)
	(at obj15 obj0)
	(at obj12 obj3)
	(at obj14 obj4)
))
)

; plan
1. (load obj7 obj15 obj4)
   deleted: (at obj15 obj4)
   added: (in obj15 obj7)
   goals met: 0 of 5
2. (fly obj7 obj4 obj0)
   deleted: (at obj7 obj4)
   added: (at obj7 obj0)
   goals met: 0 of 5
3. (unload obj7 obj15 obj0)
   deleted: (in obj15 obj7)
   added: (at obj15 obj0)
   goals met: 1 of 5
4. (load obj7 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj7)
   goals met: 1 of 5
5. (fly obj7 obj0 obj4)
   deleted: (at obj7 obj0)
   added: (at obj7 obj4)
   goals met: 1 of 5
6. (unload obj7 obj14 obj4)
   deleted: (in obj14 obj7)
   added: (at obj14 obj4)
   goals met: 2 of 5
7. (load obj6 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj6)
   goals met: 2 of 5
8. (load obj6 obj10 obj2)
   deleted: (at obj10 obj2)
   added: (in obj10 obj6)
   goals met: 2 of 5
9. (drive obj6 obj2 obj3)
   deleted: (at obj6 obj2)
   added: (at obj6 obj3)
   goals met: 2 of 5
10. (unload obj6 obj12 obj3)
   deleted: (in obj12 obj6)
   added: (at obj12 obj3)
   goals met: 3 of 5
11. (load obj6 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj6)
   goals met: 3 of 5
12. (unload obj6 obj10 obj3)
   deleted: (in obj10 obj6)
   added: (at obj10 obj3)
   goals met: 4 of 5
13. (drive obj6 obj3 obj0)
   deleted: (at obj6 obj3)
   added: (at obj6 obj0)
   goals met: 4 of 5
14. (unload obj6 obj11 obj0)
   deleted: (in obj11 obj6)
   added: (at obj11 obj0)
   goals met: 5 of 5
